Revit 2027 API
RouteAnalysisSettings.EnableIgnoredCategoryIds Property
When this setting is true, elements with category ids returned by GetIgnoredCategoryIds will be ignored in route calculation. default is true as all elements with the Door Category Id are ignored by default.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EnableIgnoredCategoryIds { get; set; }
Public Property EnableIgnoredCategoryIds As Boolean
	Get
	Set
public:
property bool EnableIgnoredCategoryIds {
	bool get ();
	void set (bool value);
}
member EnableIgnoredCategoryIds : bool with get, set
Property Value
Boolean
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace